IDEA Open Model
Region3D.Openings Property
Compatible with IDEA StatiCa 20.1
 Gets or sets the list of references to PolyLine3Dopenning curve in the Region3D.
 Namespace: IdeaRS.OpenModel.Geometry3D
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public List<ReferenceElement> Openings { get; set; }
Public Property Openings As List(Of ReferenceElement)
	Get
	Set
Property Value
Type: List<ReferenceElement>
See Also
Reference
Region3D Class
IdeaRS.OpenModel.Geometry3D Namespace